# WrongFabricSheetOverallLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WrongFabricSheetOverallLength Property
BuiltInFailures..::..FabricFailures Class See Also
---
Wrong Overall Length/Width of the Fabric Sheet Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongFabricSheetOverallLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongFabricSheetOverallLength As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongFabricSheetOverallLength {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace